app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
    if logged_in?(:site_admin)
      @blogs = Blog.recent.page(params[:page]).per(5)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @blog = Blog.includes(:comments).friendly.find(params[:id])